In [1]:
from census import Census
import gmaps
import numpy as np
import pandas as pd
import requests
import time
from scipy.stats import linregress
from matplotlib import pyplot as plt

In [2]:
# df = pd.read_csv("./patent.tsv", sep="\t", nrows = 500 )
df = pd.read_csv("csv_patent_2019/all_inventors.csv")

C:\Users\gongl\AppData\Roaming\Python\Python38\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
# Final Dataframe I want !!! Below shows all cases!!! application_number can repeat in table below

df.head()

,application_number,inventor_name_first,inventor_name_middle,inventor_name_last,inventor_rank,inventor_city_name,inventor_region_code,inventor_country_code
0,5692088,TROY,E.,PLUNK,1,Bedford,MA,US
1,5692088,JAMES,E.,HOPSON,2,Wellesley,MA,US
2,5692179,PIETRO,,VENTRESCA,1,Littleton,MA,US
3,5692179,FRANCIS,J.,O'HARA,2,Bedford,MA,US
4,5692179,CHESTER,J.,HUNT,3,Melrose,MA,US

In [9]:
df.count()

application_number       29233628
inventor_name_first      29221029
inventor_name_middle     12058982
inventor_name_last       29231538
inventor_rank            29233628
inventor_city_name       29134861
inventor_region_code     15987987
inventor_country_code    27446246
dtype: int64

In [10]:
result_df = df.drop_duplicates()
result_df

,application_number,inventor_name_first,inventor_name_middle,inventor_name_last,inventor_rank,inventor_city_name,inventor_region_code,inventor_country_code
0,5692088,TROY,E.,PLUNK,1,Bedford,MA,US
1,5692088,JAMES,E.,HOPSON,2,Wellesley,MA,US
2,5692179,PIETRO,,VENTRESCA,1,Littleton,MA,US
3,5692179,FRANCIS,J.,O'HARA,2,Bedford,MA,US
4,5692179,CHESTER,J.,HUNT,3,Melrose,MA,US
...,...,...,...,...,...,...,...,...
29233623,15981088,Se Mi,NaN,JANG,1,Changwon-si,NaN,KR
29233624,16316883,Hernan,NaN,De La Vega,1,Neckarsulm,NaN,DE
29233625,16316883,Denis,NaN,Cichuta,2,Neckarsulm,NaN,DE
29233626,16316883,Christine,NaN,Wolff,3,Neckarsulm,NaN,DE
29233627,16316883,Benjamin,NaN,Zilch,4,Neckarsulm,NaN,DE

In [11]:
result_df.count()

application_number       29233627
inventor_name_first      29221028
inventor_name_middle     12058981
inventor_name_last       29231537
inventor_rank            29233627
inventor_city_name       29134860
inventor_region_code     15987986
inventor_country_code    27446245
dtype: int64

In [12]:
result_df.dtypes

application_number       object
inventor_name_first      object
inventor_name_middle     object
inventor_name_last       object
inventor_rank             int64
inventor_city_name       object
inventor_region_code     object
inventor_country_code    object
dtype: object

In [13]:
from sqlalchemy import create_engine

In [14]:
# Create database connection
rds_connection_string = "postgres:useyourpassword@localhost:5432/ETL_USPTO"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [15]:
# Confirm tables
engine.table_names()

['patent_claims_stats',
 'uspc_class_all',
 'uspc_attorney_success_withnames',
 'attorney_success_withnames',
 'uspc_class_daysandrate',
 'application_cleaned_all',
 'application_cleaned_patented',
 'all_inventors']

In [18]:
# Load DataFrames into database
result_df.to_sql(name='all_inventors', con=engine, if_exists='append', index=False)

In [ ]:
# read_df = pd.read_sql_query('select * from all_inventors', con=engine)

In [ ]:
# read_df